dun-you-lee/Camouflage_Breakout/GLCD/stm324xg_lcd_ILI9341.c

//-------- <<<  Menu >>> -----------------
//
//=================================================
#define  RS_bit							 10
#define	 LCD_BASE_sel        0x6C000000
#define	 LCD_BASE        (LCD_BASE_sel | (0x01UL<<(RS_bit+1))-2)
//=============================================

//==============================================================
#define __Fonts_select         0x0000001E			//0
#define __default_Font         3			//1
#define __LCD_DIRECT	         1      //2 ==> 1: LANDSCAPEÆÁ  2: PORTRAIT
//=============================================

//=================================================
#define USE_resetPIN 1		// 0
#define PNr_reset 2		// 1
#define PIN_rs	5     // 2
#define PNr_backlight 1		// 3
#define PIN_bl	0         // 4
//=============================================

//=================================================
#define PNr_FSMC_set1 3									// 0
#define PinBit_FSMC_set1 0xC733     		// 1
#define PNr_FSMC_set2 4									// 2
#define PinBit_FSMC_set2	0xFF80        // 3
#define PNr_FSMC_set3 6									// 4
#define PinBit_FSMC_set3	0x1001        // 5
#define PNr_FSMC_set4 5									// 6
#define PinBit_FSMC_set4	0x0000        // 7
//=============================================


//=================================================
#define Default_TextColor		0xFFFF
#define Default_BackColor		0x0000
//=============================================

//=================================================
#define Show_DeviceID		0x01
//=============================================

//-------- <<< end  >>> ---------------

/* Includes ------------------------------------------------------------------*/
#include "stm324xg_lcd_sklin.h"
//#define USE_HAL_LL
#ifndef USE_HAL_LL
#include "stm32f4xx_fsmc.h"
#else
#include "stm32f4xx_ll_fsmc.h"
#endif


#ifndef Bit
#define Bit(x) 	(0x01ul<<x)
#endif

/** 
  * @brief LCD default font 
  */ 
#if (__default_Font == 0)
	#define LCD_DEFAULT_FONT         Font8
#endif
#if (__default_Font == 1)
	#define LCD_DEFAULT_FONT         Font12
#endif
#if (__default_Font == 2)
	#define LCD_DEFAULT_FONT         Font16
#endif
#if (__default_Font == 3)
	#define LCD_DEFAULT_FONT         Font20
#endif
#if (__default_Font == 4)
	#define LCD_DEFAULT_FONT         Font24
#endif
	
#define _fontSel   (0x01<<(__default_Font) | __Fonts_select) 
#if (_fontSel & Bit(0))
	#include ".\Fonts\font8.c"
#endif
#if (_fontSel & Bit(1))
	#include ".\Fonts\font12.c"
#endif
#if (_fontSel & Bit(2))
	#include ".\Fonts\font16.c"
#endif
#if (_fontSel & Bit(3))
	#include ".\Fonts\font20.c"
#endif
#if (_fontSel & Bit(4))
	#include ".\Fonts\font24.c"
#endif


#define ABS(X)  ((X) > 0 ? (X) : -(X))
#define MAX_POLY_CORNERS   200
#define POLY_Y(Z)          ((int32_t)((Points + Z)->X))
#define POLY_X(Z)          ((int32_t)((Points + Z)->Y))

/* Global variables to set the written text color */
typedef struct 
{ 
  uint16_t TextColor;
  uint16_t BackColor;
  sFONT    *pFont; 
}LCD_DrawPropTypeDef;

static LCD_DrawPropTypeDef DrawProp={ \
			Default_TextColor, Default_BackColor, &LCD_DEFAULT_FONT};

//*** Variables concerning FONT ************
#define	pLCD_Currentfonts DrawProp.pFont
static uint16_t wf, hf;	// font_width, font_height
static uint16_t bytes_f, bytes_wf;	// number of bytes per font, that per width line in a font
volatile uint16_t lcd_id = 0;

static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);

//########################################################
//########################################################
//  DRIVER 													 
//########################################################
//########################################################
#if __LCD_DIRECT==1
  #define  LANDSCAPE			1
	#define  LCD_ROW_NUM    240                //pages in ILI9341
	#define  LCD_COL_NUM    320                //columns in ILI9341
#else
  #define  LANDSCAPE			0
	#define  LCD_ROW_NUM    320                //pages
	#define  LCD_COL_NUM    240                //columns
#endif
	#define  LCD_PIXEL_WIDTH   (LCD_COL_NUM-1)  
	#define  LCD_PIXEL_HEIGHT  (LCD_ROW_NUM-1)   

uint16_t LCD_Pixel_Width(void){ return LCD_PIXEL_WIDTH;}
uint16_t LCD_Pixel_Height(void){ return LCD_PIXEL_HEIGHT;}

typedef struct
{
  volatile uint16_t LCD_REG;			// RS = 0
  volatile uint16_t LCD_RAM;      // RS = 1
} LCD_TypeDef;		


	GPIO_TypeDef *GPIO_backlight, *GPIO_reset;
//#define	 LCD_BASE        ((uint32_t)(0x6C000000 | 0x000007FE))	// A10 as RS
#define  LCD             ((LCD_TypeDef *) LCD_BASE)
#define  LCD_turnON_backlight	 (GPIO_backlight->BSRR = Bit(PIN_bl))		// set: output 1
#define  LCD_turnOFF_backlight (GPIO_backlight->BSRR = Bit(PIN_bl)<<16)		// reset: output 0
#define	 LCD_RESET_H  		(GPIO_reset->BSRR = Bit(PIN_rs))
#define	 LCD_RESET_L  		(GPIO_reset->BSRR = Bit(PIN_rs)<<16)
//<<<<<<<<<<<

#define LCD_WriteReg(x)	(LCD->LCD_REG = (uint16_t) x)	//lcd write reg
#define LCD_WriteData(x)	(LCD->LCD_RAM = (uint16_t) x)	//lcd write data
#define LCD_ReadData	((uint16_t) LCD->LCD_RAM)	//lcd read data

/********************************************************************************************************
// Display Inversion On & Off
********************************************************************************************************/
#define ReverseLCD()		LCD_WriteReg(0x21)	// Display Inversion ON (21h)
#define NormalLCD()			LCD_WriteReg(0x20)	// Display Inversion ON (21h)

/***********************************************
  * @brief  Configures the Parallel interface (FSMC) for LCD(Parallel mode)
  * @param  None
  * @retval None
  */
void LCD_FSMCConfig(void)
{
	FSMC_NORSRAM_InitTypeDef  hsram4_Init;
	FSMC_NORSRAM_TimingTypeDef wr_Timing, w_Timing;
	uint32_t FSMC_Bank1_NEx;
//	#define FSMC_NORSRAM_DEVICE                   FSMC_Bank1
//  #define FSMC_NORSRAM_EXTENDED_DEVICE 					FSMC_Bank1E
		FSMC_Bank1_NEx = ((LCD_BASE_sel>>26) & 0x03 )*2;	// for field of BCTR[(NEx-1)*2]
	// 0= NE1; 2= NE2; 4= NE3; 6= NE4 (=FSMC_NORSRAM_BANK4)
	
  /* Enable FSMC clock */
//  RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC, ENABLE);
		RCC->AHB3ENR |= Bit(0); //bit 0: RCC_AHB3Periph_FSMC


/*-- FSMC Configuration ------------------------------------------------------*/
/*----------------------- SRAM Bank 1 ----------------------------------------*/
  /* FSMC_Bank1 NEx (x=1,..,4) configuration */
	/* Color LCD configuration ------------------------------------
     LCD (FSMC) configured as follow:
        - Data/Address MUX = Disable
        - Memory Type = SRAM
        - Data Width = 16bit //<<<<<============
        - Write Operation = Enable
        - Extended Mode = Disable
        - Asynchronous Wait = Disable */

//====================================
	hsram4_Init.PageSize  = 0;   // extraneous and useless field
//====================================

	hsram4_Init.NSBank = FSMC_Bank1_NEx; // for field of BCTR[(NEx-1)*2]
  hsram4_Init.DataAddressMux = FSMC_DATA_ADDRESS_MUX_DISABLE;
  hsram4_Init.MemoryType = FSMC_MEMORY_TYPE_SRAM;
  hsram4_Init.MemoryDataWidth = FSMC_NORSRAM_MEM_BUS_WIDTH_16;
  hsram4_Init.BurstAccessMode = FSMC_BURST_ACCESS_MODE_DISABLE;
  hsram4_Init.WaitSignalPolarity = FSMC_WAIT_SIGNAL_POLARITY_LOW;
  hsram4_Init.WrapMode = FSMC_WRAP_MODE_DISABLE;
  hsram4_Init.WaitSignalActive = FSMC_WAIT_TIMING_BEFORE_WS;
  hsram4_Init.WriteOperation = FSMC_WRITE_OPERATION_ENABLE;
  hsram4_Init.WaitSignal = FSMC_WAIT_SIGNAL_DISABLE;
  hsram4_Init.ExtendedMode = FSMC_EXTENDED_MODE_DISABLE;		// 0x00000000U
	//disable: Device->BWTR[Bank] = 0x0FFFFFFFU;  //Device=FSMC_Bank1e,
  hsram4_Init.AsynchronousWait = FSMC_ASYNCHRONOUS_WAIT_DISABLE;
  hsram4_Init.WriteBurst = FSMC_WRITE_BURST_DISABLE;

