dun-you-lee/Camouflage_Breakout/GLCD/stm324xg_lcd_ILI9341.c
	wr_Timing.AddressSetupTime = 11;		// templet: 15
  wr_Timing.AddressHoldTime = 0;
  wr_Timing.DataSetupTime = 11;		// templet: 60
  wr_Timing.BusTurnAroundDuration = 0;
  wr_Timing.CLKDivision = 0;
  wr_Timing.DataLatency = 0;
  wr_Timing.AccessMode = FSMC_ACCESS_MODE_A;

  // Initialize SRAM control Interface BCTR[(NEx-1)*2]
  FSMC_NORSRAM_Init(FSMC_Bank1, &hsram4_Init);
	// FSMC_Bank1: FSMC Bank1 registers base address = 0xA0000000UL

  // Initialize SRAM timing Interface BCTR[(NEx-1)*2 + 1]
  FSMC_NORSRAM_Timing_Init(FSMC_Bank1, &wr_Timing, FSMC_Bank1_NEx); 

  if(hsram4_Init.ExtendedMode == FSMC_EXTENDED_MODE_ENABLE)
  {
		w_Timing.AddressSetupTime = 9;
		w_Timing.AddressHoldTime = 0;
		w_Timing.DataSetupTime = 8;
		w_Timing.BusTurnAroundDuration = 0;
		w_Timing.CLKDivision = 0;
		w_Timing.DataLatency = 0;
		w_Timing.AccessMode = FSMC_ACCESS_MODE_A;
  // Initialize SRAM extended mode timing Interface BWTR[(NEx-1)*2]
		FSMC_NORSRAM_Extended_Timing_Init(FSMC_Bank1E, &w_Timing, FSMC_Bank1_NEx,  FSMC_EXTENDED_MODE_ENABLE);  
  } else
	{
		    FSMC_Bank1E->BWTR[FSMC_Bank1_NEx] = 0x0FFFFFFFU;	// reset value
	}
  /* Enable FSMC NOR/SRAM Bank1 */
		__FSMC_NORSRAM_ENABLE(FSMC_Bank1, FSMC_Bank1_NEx); 
		//FSMC_Bank1->BTCR[FSMC_Bank1_NEx] |=  FSMC_BCR1_MBKEN;  // bit0: FSMC_BCR1_MBKEN;
}

/********************************************************************************************************
*  Function: GPIO_outPPhigh				                                                           
*  Object: set GPIO pin as output, push-pull, high speed (100 MHz)
*  Input: PortNum (0, ..., 6); PinNum (0, ..., 15)
*  Output: GPIO_x                                  
********************************************************************************************************/
static GPIO_TypeDef* GPIO_outPPhigh(uint32_t PortNum, uint32_t PinNum)
{
	GPIO_TypeDef *GPIO_x;
	uint32_t y=PinNum;

		RCC->AHB1ENR |=  (1UL << PortNum);     // enable clock for GPIOx
    // __SPI1_CS_PORT = 0: PORTA, 1: PORTB, ..., 10: PORTK
    GPIO_x  = (GPIO_TypeDef *)(AHB1PERIPH_BASE + 0x0400 * PortNum);

    GPIO_x->MODER   = (GPIO_x->MODER & ~Bit((y*2+1)) )  | Bit(y*2); //Output mode (01b)
    GPIO_x->OSPEEDR = (GPIO_x->OSPEEDR |  (0x03ul<<(y*2)) ); //high speed (11b)
    GPIO_x->OTYPER  &= ~Bit(y);                      // push-pull (0b)
    GPIO_x->PUPDR   &= ~(0x03ul<<(y*2));       //NO pull (00b)
  if (y < 8)
    GPIO_x->AFR[0]  &= ~(0x0Ful<<(y*4));      // AF0
  else
    GPIO_x->AFR[1]  &= ~(0x0Ful<<((y-8)*4));  // AF0
	
		return GPIO_x;
}

/********************************************************************************************************
*  Function: GPIO_AF12PPhigh				                                                           
*  Object: set GPIO pin as output, push-pull, high speed (100 MHz)
*  Input: PortNum (0, ..., 6); PinNum (0, ..., 15)
*  Output: none                                  
********************************************************************************************************/
static void GPIO_AF12PPhigh(uint32_t PortNum, uint32_t PinBit)
{
	GPIO_TypeDef *GPIO_x;
	uint32_t temp, chg1= PinBit, chg2=0, chg4L=0, chg4H=0;
	uint32_t fill2=0, fill4L=0, fill4H=0;

		RCC->AHB1ENR |=  (1UL << PortNum);     // enable clock for GPIOx
    // __SPI1_CS_PORT = 0: PORTA, 1: PORTB, ..., 10: PORTK
    GPIO_x  = (GPIO_TypeDef *)(AHB1PERIPH_BASE + 0x0400 * PortNum);

  
	for (temp=0; temp<16; temp++){
			if (PinBit & 0x01){
			   chg2 |= (0x03ul) << (temp*2);
			   fill2 |= (0x02ul) << (temp*2);
			  if (temp <8){
			   chg4L |= (0x0Ful) << (temp*4);
			   fill4L |= (0x0Cul) << (temp*4);
			  }else {
			   chg4H |= (0x0Ful) << ((temp-8)*4);
			   fill4H |= (0x0Cul) << ((temp-8)*4);
			  }				
		  }
			PinBit = PinBit >> 1;
	}

		GPIO_x->MODER   = (GPIO_x->MODER & ~chg2)  | fill2; //AF mode (10b)
    GPIO_x->OSPEEDR = (GPIO_x->OSPEEDR |  chg2 ); //high speed (11b)
    GPIO_x->OTYPER  &= ~chg1;                      // push-pull (0b)
    GPIO_x->PUPDR   &= ~chg2;       //NO pull (00b)
  if (chg4L)
	{
    temp = GPIO_x->AFR[0];
    temp &= ~chg4L;						// clear to 0000b
		GPIO_x->AFR[0] = (temp | fill4L);      // AF12  (1100b)
	}
	if (chg4H)
	{
    temp = GPIO_x->AFR[1];
    temp &= ~chg4H;						// clear to 0000b
		GPIO_x->AFR[1] = (temp | fill4H);      // AF12  (1100b)
	}
}

/********************************************************************************************************
*  Function: delay_ms				                                                           
*  Object: lcd init wait..
*  Input: Num
*  Output: none                                  
*  brief: time = Num * 1ms
********************************************************************************************************/
void delay_ms(uint16_t Num)
{
		volatile uint16_t Timer;
		while(Num--)
		{
		 	Timer = 11500;
			while(Timer--); 
		}
}

/********************************************************************************************************
*  Function: LCD_DisplayDevID				                                                           
*  Object: Display LCD device ID on the screen
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_DisplayDevID()
{	
#include <stdio.h>
  char p_text[13] = "";
	sprintf(p_text,"LCD ID: %04X",lcd_id);	//LCD ID			 	
	LCD_DisplayStringLineCol(1, 2, p_text);		// line 0, column 2
}	   

/********************************************************************************************************
*  Function: LCD_Reset				                                                           
*  Object: lcd reset control
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_Reset(void)
{
#if USE_resetPIN
		LCD_RESET_L;
		delay_ms(150);		// 150 ms
		LCD_RESET_H;
		delay_ms(50);	// 50 ms
#endif
}

uint16_t GRAM_mode;
/********************************************************************************************************
*  Function: LCD_Init				                                                           
*  Object: lcd initialization
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_Init(void)
{ 
	volatile uint16_t data1, data2;
		//-- LCD PORT INIT --
//		LCD_PortInit();
		GPIO_backlight = GPIO_outPPhigh(PNr_backlight, PIN_bl);	// backlight pin (LIG): PB0
		GPIO_reset = GPIO_outPPhigh(PNr_reset, PIN_rs);  				// reset pin (RST): PC5
		if (PinBit_FSMC_set1)	GPIO_AF12PPhigh(PNr_FSMC_set1, PinBit_FSMC_set1);
		if (PinBit_FSMC_set2)	GPIO_AF12PPhigh(PNr_FSMC_set2, PinBit_FSMC_set2);
		if (PinBit_FSMC_set3)	GPIO_AF12PPhigh(PNr_FSMC_set3, PinBit_FSMC_set3);
		if (PinBit_FSMC_set4)	GPIO_AF12PPhigh(PNr_FSMC_set4, PinBit_FSMC_set4);
/*  GPIOD: AF_FSMC, Speed_100MHz , push pull, no pull-up or pull-down 
	  --------------------------------------------------------------
	  | Pin: PD |   0   1    4    5       8    9   10   14   15
    | GLCD    |  D2  D3   (RD) (WR)    D13  D14  D15  D0   D1
	  --------------------------------------------------------------
    GPIOE: AF_FSMC, Speed_100MHz , push pull, no pull-up or pull-down 
	  --------------------------------------------------------------
	  | Pin: PE |    7   8   9   10  11  12  13   14   15
    | GLCD    |   D4  D5  D6  D7  D8  D9  D10  D11  D12
	  --------------------------------------------------------------
   GPIOG: AF_FSMC, Speed_100MHz , push pull, no pull-up or pull-down 
	  --------------------------------------------------------------
	  | Pin : PG |   0         12
    | GLCD     |  (RS)      (CS)
	            (FSMC_A10)  (FSMC_NE4)
	  --------------------------------------------------------------
*/

	
		LCD_FSMCConfig();

