dun-you-lee/Camouflage_Breakout/GLCD/stm324xg_lcd_ILI9341.c
		//-- LCD RESET--
		LCD_Reset();
	// ######### Read ID, just for test ##################
		LCD_WriteReg(0xD3);	// 0xD3: Chip Driver ID
 		data1 = LCD_ReadData;				// dummy		
 		data2 = LCD_ReadData;				// ID Version (0x00)
 		data1 = LCD_ReadData;				// driver ID higher byte	(0x0093)
 		data2 = LCD_ReadData;				// driver IDlower byte(0x0041)		

		lcd_id = (data1<<8) | data2;
		//-------------- Initial Sequence ---------------
		//************* Start Initial Sequence **********//	
		LCD_WriteReg(0xCF);  // Power control B (CFh)
		LCD_WriteData(0x00); 
		LCD_WriteData(0xC1); 
		LCD_WriteData(0X30); 
		LCD_WriteReg(0xED);  // Power on sequence control (EDh)
		LCD_WriteData(0x64); 
		LCD_WriteData(0x03); 
		LCD_WriteData(0X12); 
		LCD_WriteData(0X81); 
		LCD_WriteReg(0xE8);  // Driver timing control A (E8h)
		LCD_WriteData(0x85); 
		LCD_WriteData(0x10); 
		LCD_WriteData(0x7A); 
		LCD_WriteReg(0xCB);  // Power control A (CBh)
		LCD_WriteData(0x39); 
		LCD_WriteData(0x2C); 
		LCD_WriteData(0x00); 
		LCD_WriteData(0x34); 
		LCD_WriteData(0x02); 
		LCD_WriteReg(0xF7);  
		LCD_WriteData(0x20); 
		LCD_WriteReg(0xEA);  
		LCD_WriteData(0x00); 
		LCD_WriteData(0x00); 
		LCD_WriteReg(0xC0);    // Power Control 1 (C0h)
		LCD_WriteData(0x1B);   //VRH[5:0] 
		LCD_WriteReg(0xC1);    // Power Control 2 (C1h)
		LCD_WriteData(0x01);   //SAP[2:0];BT[3:0] 
		LCD_WriteReg(0xC5);    // VCOM Control 1(C5h)
		LCD_WriteData(0x30); 	 //3F
		LCD_WriteData(0x30); 	 //3C
		LCD_WriteReg(0xC7);    // VCOM Control 2(C7h)
		LCD_WriteData(0XB7); 
		LCD_WriteReg(0x3A);   	// Pixel Format Set (3Ah)
		LCD_WriteData(0x55); 		// 16 bits Format
		LCD_WriteReg(0xB1);   
		LCD_WriteData(0x00);   
		LCD_WriteData(0x1A); 
		LCD_WriteReg(0xB6);    // Display Function Control 
		LCD_WriteData(0x0A); 
		LCD_WriteData(0xA2); 
		LCD_WriteReg(0xF2);    // 3Gamma Function Disable 
		LCD_WriteData(0x00); 
		LCD_WriteReg(0x26);    //Gamma curve selected 
		LCD_WriteData(0x01); 
		LCD_WriteReg(0xE0);    //Set Gamma 
		LCD_WriteData(0x0F); 
		LCD_WriteData(0x2A); 
		LCD_WriteData(0x28); 
		LCD_WriteData(0x08); 
		LCD_WriteData(0x0E); 
		LCD_WriteData(0x08); 
		LCD_WriteData(0x54); 
		LCD_WriteData(0XA9); 
		LCD_WriteData(0x43); 
		LCD_WriteData(0x0A); 
		LCD_WriteData(0x0F); 
		LCD_WriteData(0x00); 
		LCD_WriteData(0x00); 
		LCD_WriteData(0x00); 
		LCD_WriteData(0x00); 		 
		LCD_WriteReg(0XE1);    //Set Gamma 
		LCD_WriteData(0x00); 
		LCD_WriteData(0x15); 
		LCD_WriteData(0x17); 
		LCD_WriteData(0x07); 
		LCD_WriteData(0x11); 
		LCD_WriteData(0x06); 
		LCD_WriteData(0x2B); 
		LCD_WriteData(0x56); 
		LCD_WriteData(0x3C); 
		LCD_WriteData(0x05); 
		LCD_WriteData(0x10); 
		LCD_WriteData(0x0F); 
		LCD_WriteData(0x3F); 
		LCD_WriteData(0x3F); 
		LCD_WriteData(0x0F); 
		LCD_WriteReg(0x11); //Exit Sleep
		delay_ms(120);
		// LCD_WriteReg(0x29); //display on

   	LCD_WriteReg(0x36);  // Memory Access Control (36h)
  #if (LANDSCAPE == 1)
		GRAM_mode = 0xA8;	// bit 7, 5, 3 = 1   
    /* AM=1   (address is updated in vertical writing direction)              */
		LCD_WriteData(GRAM_mode);	// bit 7, 5, 3 = 1  
		// bit 3 (BGR) = 1: (Blue:Green:Red)
		// bit 5 (column and row exchange) = 1
		// bit 6 (column addr. order) = 0   rightward: 0 ==> width 
    // bit 7 (page (row) addr. order) = 1  downward: height ==> 0
		//
		//   --------------------> page (x)
		//   |
		//   |
		//   \/
		//   column (y) 
		//
  #else
		GRAM_mode = 0xC8;	// bit 7, 6, 3 = 1    
    /* AM=0   (address is updated in horizontal writing direction)            */
		LCD_WriteData(GRAM_mode);	// bit 7, 6, 3 = 1  
		// bit 3 (BGR) = 1
		// bit 6 (column addr. order) = 1   upward: width ==> 0
    // bit 7 (page (row) addr. order) = 1  rightward: height ==> 0
		//
		//   column (x) 
		//   ^
		//   |
		//   |
		//   --------------------> page (y)
		//
  #endif
	
	//----- setting the following initial variables:
	//----- Current font
	//----- wf, hf, bytes_wf, bytes_f
	LCD_SetFont( &LCD_DEFAULT_FONT);
	//----- text color; background color
	LCD_SetColors(Default_TextColor, Default_BackColor);
	
		LCD_Clear(Default_BackColor);
    delay_ms(50); 
#if Show_DeviceID
		LCD_DisplayDevID();
#endif
		LCD_DisplayOn();
}

/********************************************************************************************************
*  Function: LCD_OpenWin				                                                           
*  Object: lcd open window for display
*  Input: x0,y0, x1, y1
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_OpenWin(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
		LCD_WriteReg(0x2A);					// Column Address Set (2Ah)
		LCD_WriteData(x0>>8);
		LCD_WriteData(0x00FF&x0);		
		LCD_WriteData(x1>>8);
		LCD_WriteData(0x00FF&x1);
	
		LCD_WriteReg(0x2B);				// Page (Row) Address Set (2Bh) 
		LCD_WriteData(y0>>8);
		LCD_WriteData(0x00FF&y0);		
		LCD_WriteData(y1>>8);
		LCD_WriteData(0x00FF&y1);

		LCD_WriteReg(0x2C);
}

/********************************************************************************************************
*  Function: LCD_toPortrait				                                                           
*  Object: lcd display in Portrait mode
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_toPortrait(void)
{
   	LCD_WriteReg(0x36);  // Memory Access Control (36h)
		LCD_WriteData(0xC8);	// bit 7, 6, 3 = 1  
}
/********************************************************************************************************
*  Function: LCD_toLandscape				                                                           
*  Object: lcd display in Portrait mode
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_toLandscape(void)
{
   	LCD_WriteReg(0x36);  // Memory Access Control (36h)
		LCD_WriteData(0xA8);	// bit 7, 6, 3 = 1  
}
/********************************************************************************************************
*  Function: LCD_toDefaultDisDirection				                                                           
*  Object: lcd display in Portrait mode
*  Input: none
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_toDefaultDisDirection(void)
{
   	LCD_WriteReg(0x36);  // Memory Access Control (36h)
		LCD_WriteData(GRAM_mode);	// bit 7, 6, 3 = 1  
}
/********************************************************************************************************
*  Function: LCD_Clear				                                                           
*  Object: lcd clear screen
*  Input: backcolor
*  Output: none                                  
*  brief: none
********************************************************************************************************/
void LCD_Clear(uint16_t BackColor)
{
		uint16_t i,j;
		LCD_OpenWin(0, 0, LCD_COL_NUM-1, LCD_ROW_NUM-1);
		for(i = 0; i < LCD_ROW_NUM; i++)
			 for(j =0; j < LCD_COL_NUM; j++)
					 LCD_WriteData(BackColor);
}

/**
  * @brief  Enable the Display.
  * @param  None
  * @retval None
  */
void LCD_DisplayOn(void)
{
 	//---- turn on backlight ----------
	LCD_turnON_backlight;			// //   GPIOB->BSRR = 0x01;
	
  /* Display On */
	LCD_WriteReg(0x29);				// Display ON (0x29)
}

/**
  * @brief  Disable the Display.
  * @param  None
  * @retval None
  */
void LCD_DisplayOff(void)
{
  /* Display Off */
	LCD_WriteReg(0x28);				// Display OFF (0x28)
	//---- turn off backlight ----------
	LCD_turnOFF_backlight;		//   GPIOB->BSRR = 0x01<<16;	
}

//###########################################################
//
//     Hardware Abstract Layer
//
//###########################################################
/**
  * @brief  Sets a display window by width (w) and height (h)
  *
*/
#define LCD_DisplayWindow_WnH(x, y, w, h)  LCD_OpenWin(x, y, x+w-1, y+h-1)

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  DrawProp.TextColor = _TextColor;
  DrawProp.BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = DrawProp.TextColor; 
	*_BackColor = DrawProp.BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  DrawProp.TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  DrawProp.BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void LCD_SetFont(sFONT *pfonts)
{
	DrawProp.pFont	= pfonts;	// pLCD_Currentfonts = pfonts;
	//----- modified by Shir-Kuan Lin
	wf = pfonts->Width; 	// font_width
	hf = pfonts->Height; // font_height
	bytes_wf = (wf+7) /8;	// number of bytes per width line in a font
	bytes_f = hf * bytes_wf;	// number of bytes per font (see Font12_Table or Font20_Table)
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
  return pLCD_Currentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearStringLine(uint16_t LineNr)
{
  uint16_t bColor;
  uint16_t x, y;
	if (((LineNr+1) * pLCD_Currentfonts->Height) > (LCD_PIXEL_HEIGHT)){
		return;
	}
	LineNr = LineNr * pLCD_Currentfonts->Height;
	bColor = DrawProp.BackColor;
	
	LCD_OpenWin(0, LineNr, LCD_PIXEL_WIDTH, LineNr+hf-1);
  for(y = 0; y < hf; y++)		
  {
		for(x = 0; x <= LCD_PIXEL_WIDTH; x++)
		{
			LCD_WriteData(bColor);
		}
	}
}

/********************************************************************************************************
*  Function: LCD_DisplayChar				                                                           
*  Object: Display an ASCII character
*  Input: start point, end point, ASCII code, text color, background color
*  Output: none                                  
*  brief: none
********************************************************************************************************/
static void LCD_DisplayChar(uint16_t Xpos, uint16_t Ypos,  uint8_t Ascii, uint16_t fColor, uint16_t bColor)
{
	// wf =: font_width,
	// hf =:  font_height
// bytes_wf = number of bytes per width line in a font
// bytes_f  = number of bytes per font

	int	iw;
  uint32_t byteNr, jw;
	uint16_t  hp_limit;
	const uint8_t *c;
	
	if((Ascii > '~') || (Ascii < ' ')) Ascii= ' ';
		
	iw = Ascii - 32;  // make ' ' (space) at offset of 0
  c = &pLCD_Currentfonts->table[iw * bytes_f];	
	
