dun-you-lee/Camouflage_Breakout/GLCD/stm324xg_lcd_ILI9341.c
  LCD_DisplayWindow_WnH(Xpos, Ypos, Xsize, Ysize);
  
  for(j= 0; j < Ysize; j++)
  {
		for(i= 0; i < Xsize; i++)
		{
    /* Write 16-bit GRAM Reg */
			LCD_WriteData(*(volatile uint16_t *)pdata);
			pdata += 2;
		}
	}

}


/**
  * @brief  Displays an poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
void LCD_PolyLine(pPoint Points, uint16_t PointCount)
{
  uint16_t X, Y;

  if(PointCount < 2)
  {
    return;
  }

  while(--PointCount)
  {
    X = Points->X;
    Y = Points->Y;
    Points++;
    LCD_DrawLine(X, Y, Points->X, Points->Y);
  }
}

/**
  * @brief  Displays an relative poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @param  Closed: specifies if the draw is closed or not.
  *           1: closed, 0 : not closed.
  * @retval None
  */
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed)
{
  uint16_t X = 0, Y = 0;
  pPoint First = Points;

  if(PointCount < 2)
  {
    return;
  }
  X = Points->X;
  Y = Points->Y;
  while(--PointCount)
  {
    Points++;
    LCD_DrawLine(X, Y, X + Points->X, Y + Points->Y);
    X = X + Points->X;
    Y = Y + Points->Y;
  }
  if(Closed)
  {
    LCD_DrawLine(First->X, First->Y, X, Y);
  }
}

/**
  * @brief  Displays a closed poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
void LCD_DrawPolygon(pPoint Points, uint16_t PointCount)
{
  LCD_PolyLine(Points, PointCount);
  LCD_DrawLine(Points->X, Points->Y, (Points+PointCount-1)->X, (Points+PointCount-1)->Y);
}

/**
  * @brief  Displays a relative poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
void LCD_PolyLineRelative(pPoint Points, uint16_t PointCount)
{
  LCD_PolyLineRelativeClosed(Points, PointCount, 0);
}

/**
  * @brief  Displays a closed relative poly-line (between many points).
  * @param  Points: pointer to the points array.
  * @param  PointCount: Number of points.
  * @retval None
  */
void LCD_ClosedPolyLineRelative(pPoint Points, uint16_t PointCount)
{
  LCD_PolyLineRelativeClosed(Points, PointCount, 1);
}

/**
  * @brief  Draws an ellipse on LCD.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  XRadius: Ellipse X radius
  * @param  YRadius: Ellipse Y radius
  * @retval None
  */
void LCD_DrawEllipse(int Xpos, int Ypos, int XRadius, int YRadius)
{
  int x = 0, y = -YRadius, err = 2-2*XRadius, e2;
  float K = 0, rad1 = 0, rad2 = 0;
  
  rad1 = (float) XRadius;
  rad2 = (float) YRadius;
  
  K = (float)(rad2/rad1);
  
  do {      
    LCD_DrawPixel((Xpos-(uint16_t)(x/K)), (Ypos+y), DrawProp.TextColor);
    LCD_DrawPixel((Xpos+(uint16_t)(x/K)), (Ypos+y), DrawProp.TextColor);
    LCD_DrawPixel((Xpos+(uint16_t)(x/K)), (Ypos-y), DrawProp.TextColor);
    LCD_DrawPixel((Xpos-(uint16_t)(x/K)), (Ypos-y), DrawProp.TextColor);      
    
    e2 = err;
    if (e2 <= x) {
      err += ++x*2+1;
      if (-y == x && e2 <= y) e2 = 0;
    }
    if (e2 > y) err += ++y*2+1;     
  }
  while (y <= 0);
}


/**
  * @brief  Fills a triangle (between 3 points).
  * @param  Points: Pointer to the points array
  * @param  Points[0].x: Point 1 X position
  * @param  Points[0].y: Point 1 Y position
  * @param  Points[1].x: Point 2 X position
  * @param  Points[1].y: Point 2 Y position
  * @param  Points[2].x: Point 3 X position
  * @param  Points[2].y: Point 3 Y position
  * @retval None
  */
// revised on 2025/2/12
void LCD_FillTriangle(pPoint Points)
{
	uint16_t	xp[3], yp[3], i, tmp, x_mid;
  int32_t int_tmp, deltaX1, deltaY1, deltaX2, deltaY2;
  uint16_t x, y, ii;
	
		xp[0] = Points[0].X;
		yp[0] = Points[0].Y;
	for (i=1; i<3; i++)
	{
		x = Points[i].X;
		y = Points[i].Y;
		  if (yp[0] > y){
				xp[i] = xp[0];
				xp[0] = x;
				yp[i] = yp[0];
				yp[0] = y;
			} else{
				xp[i] = x;
				yp[i] = y;
			}
	}	
	if (yp[1] > yp[2]){
				tmp = xp[1];
				xp[1] = xp[2];
				xp[2] = tmp;
				tmp = yp[1];
				yp[1] = yp[2];
				yp[2] = tmp;
	}
	// NOTE: yp[2] >= yp[1] >= yp[0]
	//----------
	// Point 0 with smallest y; 
	// Point 1 at the middle height
	// Point 2 with largest y
	//------------ 
	deltaY2 = (int32_t) yp[2]- yp[0];		// deltaY2 >= 0
		if (deltaY2 == 0){	// i.e. deltaY2 = deltaY1 = 0
			if( xp[2] < xp[0]){ 
				x = xp[2];
				tmp = xp[0] - x;
			} else {
				x = xp[0];
				tmp = xp[2] - x;
			}
			LCD_DrawHLine(x, yp[0], tmp+1);	// a horizontal line
			return;
		}
	// ---------- deltaY2 > 0 in the following --------------------
  deltaX2 = (int32_t) xp[2]- xp[0];		// Line 0_2
	deltaY1 = (int32_t) yp[1]- yp[0];		// deltaY1 >= 0
  deltaX1 = (int32_t) xp[1]- xp[0];		// Line 0_1
		int_tmp = (deltaX2 * deltaY1) /deltaY2;

	x_mid = (uint16_t)(xp[0] + int_tmp);
	//====== 1st subtriangle (P0-P1-Px, where Px=(int_temp, y1))
		if ( x_mid < xp[1] ){ // Line 0_2 is left to Line 0_1
			int_tmp = deltaX1;
			deltaX1 = deltaX2;				// Line 0_2
			deltaX2 = int_tmp;				// Line 0_1
			int_tmp = deltaY1;
			deltaY1 = deltaY2;
			deltaY2 = int_tmp;
		}
	x = xp[0];
	y = yp[0];
	if (deltaY1 == 0){
		if (xp[1] < x) {
			x = xp[1];
			tmp = (uint16_t) (-deltaX1);
		}	else {
		  tmp = (uint16_t) deltaX1;
		}
		LCD_DrawHLine(x, y, tmp+1);	// a horizontal line
	}else {
		LCD_DrawPixel(x, y, DrawProp.TextColor); // draw only point P0
		ii = 0;
		for (i=y+1; i<=yp[1]; i++)	// downward
		{
				int32_t x_tmp, length;
				
				ii++;
				x_tmp = deltaX1*ii /deltaY1;
				 length = deltaX2*ii /deltaY2- x_tmp; // Note: deltaY2 >= deltaY1 > 0 and  ll must >= 0
				 LCD_DrawHLine((uint16_t) (x+x_tmp), i, (uint16_t) length+1);
		}	
	}
	//====== 2nd subtriangle 
	
	if ( x_mid < xp[1] ){ // Line 2_0 is left to Line 2_1
		deltaX1 = (int32_t) -deltaX1;		// line 2_0
//		deltaY1 = (int32_t) yp[2]- yp[0];		
		deltaX2 = (int32_t) xp[1]-xp[2];		// line 2_1
		deltaY2 = (int32_t) yp[2]- yp[1];		
	} else{	// for x_mid >= xp[1]; Line 2_0 is right to Line 2_1
		deltaX1 = (int32_t) xp[1]-xp[2];		// line 2_1
		deltaY1 = (int32_t) yp[2]- yp[1];		
		deltaX2 = (int32_t) -deltaX2;		// line 2_0
//		deltaY2 = (int32_t) yp[2]- yp[0];		
	}
		LCD_DrawPixel(xp[2], yp[2], DrawProp.TextColor); // draw only point P0
		ii = 0;
		for (i=yp[2]-1; i>=yp[1]; i--)			// upward
		{
				int32_t x_tmp, length;
				
