dun-you-lee/Camouflage_Breakout/GLCD/stm324xg_lcd_ILI9341.c
				ii++;
				x_tmp = deltaX1*ii / deltaY1;
				length = deltaX2*ii /deltaY2- x_tmp; // Note: deltaX2 >= deltaX1 > 0, so length must >= 0

				LCD_DrawHLine((uint16_t) (x+x_tmp), i, (uint16_t) length+1);
		}	
	}

/**
  * @brief  Draws a full poly-line (between many points).
  * @param  Points: Pointer to the points array
  * @param  PointCount: Number of points
  * @retval None
  */
void LCD_FillPolygon(pPoint Points, uint16_t PointCount)
{
  Point tmp_pt[3];
  int16_t i;

  if(PointCount <=2)
  {
    LCD_PolyLine(Points, PointCount);
		return;
  }

	LCD_FillTriangle(Points);
	if (PointCount == 3){
		return;
	}
  

	tmp_pt[0].X = Points[0].X;
	tmp_pt[0].Y = Points[0].Y;
	
  for(i = 1; i < (PointCount-1); i++)
  {
		tmp_pt[1].X = Points[i+1].X;
		tmp_pt[1].Y = Points[i+1].Y;
		tmp_pt[2].X = Points[i+2].X;
		tmp_pt[2].Y = Points[i+2].Y;
    
		LCD_FillTriangle(tmp_pt);
  }
}

/**
  * @brief  Draws a full ellipse.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  XRadius: Ellipse X radius
  * @param  YRadius: Ellipse Y radius  
  * @retval None
  */
void LCD_FillEllipse(int Xpos, int Ypos, int XRadius, int YRadius)
{
  int x = 0, y = -YRadius, err = 2-2*XRadius, e2;
  float K = 0, rad1 = 0, rad2 = 0;
  
  rad1 = XRadius;
  rad2 = YRadius;
  
  K = (float)(rad2/rad1);    
  
  do 
  { 
    LCD_DrawHLine((Xpos-(uint16_t)(x/K)), (Ypos+y), (2*(uint16_t)(x/K) + 1));
    LCD_DrawHLine((Xpos-(uint16_t)(x/K)), (Ypos-y), (2*(uint16_t)(x/K) + 1));
    
    e2 = err;
    if (e2 <= x) 
    {
      err += ++x*2+1;
      if (-y == x && e2 <= y) e2 = 0;
    }
    if (e2 > y) err += ++y*2+1;
  }
  while (y <= 0);
}


//============== NEW by Shir-Kuan Lin ++++++++++++
sFONT *lFont;
uint16_t	ltColor, lbColor;

//----------------------
void LCD_SaveColors(void)
{
	ltColor = DrawProp.TextColor;
	lbColor = DrawProp.BackColor;
}
//----------------------
void LCD_RestoreColors(void)
{
	DrawProp.TextColor = ltColor;
	DrawProp.BackColor = lbColor;
}
//----------------------
void LCD_SaveFont(void)
{
	lFont = pLCD_Currentfonts;
}
//----------------------
void LCD_RestoreFont(void)
{
  LCD_SetFont(lFont);
}

//########################################################
//########################################################
//  Test  Experiments 													 
//########################################################
//########################################################

/**
  * @brief  Test LCD Display
  * @retval None
  */
void LCD_RGB_Test(void)
{
  uint32_t index, p1, p;

  LCD_OpenWin(0, 0, LCD_PIXEL_WIDTH, LCD_PIXEL_HEIGHT);
	p = (LCD_PIXEL_HEIGHT+1)/3;
	p = p * (LCD_PIXEL_WIDTH+1);

	/* R */
  for(index = 0; index <= p; index++)
  {
    LCD_WriteData(LCD_COLOR_RED);
  }
	  
  /* G */
	p = 2 * p;
  for(; index <= p; index++)
  {
    LCD_WriteData(LCD_COLOR_GREEN);
  }
	  
	/* B */
	p = (LCD_PIXEL_HEIGHT+1)*(LCD_PIXEL_WIDTH+1);
  for(; index <= p; index++)
  {
    LCD_WriteData(LCD_COLOR_BLUE);
  }

	p1 = (DrawProp.pFont)->Height; // font_height in pixel;	
	p1 = ((LCD_PIXEL_HEIGHT+1) +(p1-1)) /p1;
	LCD_SetColors(WHITE, RED);
  LCD_DisplayStringLineCol(2, 1,"R"); // line 2, column 1
	p = p1/3;
	LCD_SetBackColor(GREEN);
  LCD_DisplayStringLineCol((uint8_t) (2+p), 1,"G"); // line , column 1
	p = (2*p1)/3;
	LCD_SetBackColor(BLUE);
  LCD_DisplayStringLineCol((uint8_t) (2+p), 1,"B"); // line , column 1
	  delay_ms(1000); /* delay 1000 ms */
}


//==========================
// LCD display off/on test 
//==========================
void LCD_DisplayOnTest(void)
{
	LCD_DisplayOff();

	delay_ms(3000);
 	//---- turn on Display ----------
	LCD_DisplayOn();
}

/**
  * @brief  Menu Initialisation routine
  */
#define point_Count 3
#define X_c	160
#define Y_c 215
#define H_R 9
void MenuInit(void)
{
  uint16_t wd;
	Point Points0[point_Count]={ 
		{(X_c-H_R+1), (Y_c-H_R)}, // Upper Left 
		{(X_c+H_R+1), (Y_c)}, 		// Right Center
		{(X_c-H_R+1), (Y_c+H_R)}, // Down Left
	};
	Point Points1[point_Count]={ 
		{(X_c+2*H_R+1), (Y_c-H_R)}, // Upper Right
		{(X_c+H_R+1), (Y_c)}, 		// Left Center
		{(X_c+2*H_R+1), (Y_c+H_R)}, // Down Right
	};

	LCD_RGB_Test();
	delay_ms(200);

	/*	save current Font, Back Color*/
	LCD_SaveColors();

	LCD_SaveFont();
//	LCD_SetFont(&Font20);
  LCD_Clear(LCD_COLOR_BLUE2);
	LCD_SetColors(LCD_COLOR_MAGENTA, LCD_COLOR_BLUE2); // Test = white; back = blue

	LCD_DisplayStringLineCol(0, 2,"PARADIGM LCD DEMO");		// line 0, column 2
  LCD_SetTextColor(LCD_COLOR_GREEN);
  LCD_DisplayStringLineCol(2, 1,"Watch LEDs flashing"); // line 2, column 1

	//----------------------------------
	if (LANDSCAPE == 0) wd = 184;
	else	wd = 220;
  LCD_SetTextColor(LCD_COLOR_YELLOW);
  /*Draw a rectangle with: Start X-Cood,  Start Y-Cood,  Width,  Heigt*/
  LCD_DrawRect(50,80,wd,120);
  LCD_SetTextColor(LCD_COLOR_CYAN);
  /*Draw a rectangle with: Start X-Cood,  Start Y-Cood,  Width,  Heigt*/
  LCD_DrawRect(45,75,wd+10,130);
  /*Draw a triangle with: Start X-Cood,  Start Y-Cood,  Width,  Heigt*/
		LCD_FillTriangle(Points0);
		LCD_FillPolygon(Points1, 3);
		LCD_SetTextColor(DARKBLUE);
		LCD_DrawPolygon(Points0,  3);
		LCD_DrawPolygon(Points1,  3);
	//----------------------------------
  LCD_SetTextColor(LCD_COLOR_RED);
	LCD_FillRect(53, 83, wd-6, 114);
	LCD_SetTextColor(LCD_COLOR_WHITE);
  LCD_DisplayStringLineCol(5, 4, "Value:");
	LCD_DrawCircle(160, 160, 30);
  LCD_SetTextColor(LCD_COLOR_GREEN);
	LCD_FillCircle(160, 160, 26);


	/*	restore last Font, Back Color*/
	LCD_RestoreFont();
	LCD_RestoreColors();
	
	delay_ms(2000);
	ReverseLCD();
	delay_ms(4000);
	NormalLCD();

	delay_ms(2000);
	LCD_DisplayOnTest();
}


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/


/**
  * @brief  Reads RGB Image (16 bpp).
  * @param  Xpos:  X position in the LCD
  * @param  Ypos:  Y position in the LCD
  * @param  Xsize: X size in the LCD
  * @param  Ysize: Y size in the LCD
  * @param  pdata: Pointer to the RGB Image address.
  * @retval None
  */
void LCD_ReadRGBImage(uint16_t Xpos, uint16_t Ypos, uint16_t Xsize, uint16_t Ysize, uint8_t *pdata)
{
  uint16_t index, size;
  uint16_t x1, y1;
	volatile uint16_t data1, data2;
  
	if (Xpos > LCD_PIXEL_WIDTH){
		Xpos = LCD_PIXEL_WIDTH;
		if (Ypos > LCD_PIXEL_HEIGHT) return;
	}
	if (Ypos > LCD_PIXEL_HEIGHT) Ypos = LCD_PIXEL_HEIGHT;
	x1 = Xpos + Xsize-1;
	y1 = Ypos + Ysize-1;
	if (x1 > LCD_PIXEL_WIDTH) Xsize = LCD_PIXEL_WIDTH+1 - Xpos;
	if (y1 > LCD_PIXEL_HEIGHT) Ysize = LCD_PIXEL_HEIGHT+1 - Ypos;
  LCD_DisplayWindow_WnH(Xpos, Ypos, Xsize, Ysize);

	LCD_WriteReg(0x2E);	// 0x2E: Memory Read
	//delay_ms(1);
  size = (Xsize * Ysize);
	LCD_ReadData;   // the 1st return value is "dummy"

  for(index = 0; index < (size/2); index++)
	{
 		data1 = LCD_ReadData;							// data1[15:11] = RED1[4:0]; data1[7:2] = GREED1[5:0]
		data1 = (data1 & 0xF800) | ((data1<<3) & 0x07E0);
 		data2 = LCD_ReadData;							// data2[15:11] = BLUE1[4:0]; data1[7:3] = RED2[4:0]
		
 		*((volatile uint16_t *) pdata)= data1 | (data2>>11);
     pdata += 2;
		data1 = (data2<<8) & 0xF800;
 		data2 = LCD_ReadData;							// data2[15:10] = GREEN2[5:0]; data1[7:3] = BLUE2[4:0]
		data1 = data1 | ((data2>>5) & 0x07E0) | ((data2>>3) & 0x001F);
 		*((volatile uint16_t *) pdata)= data1;
     pdata += 2;
	}
	
	if( size & 0x01 )	// size is an odd integer
	{
 		data1 = LCD_ReadData;
		data1 = (data1 & 0xF800) | ((data1<<3) & 0x07E0);
 		data2 = LCD_ReadData;
		
 		*((volatile uint16_t *) pdata)= data1 | (data2>>11);
	}
}

//?????????????????
//################## Low LEVEL DRIVER
/**
  * @brief  Reads the selected LCD Register.
  * @param  LCD_Reg: address of the selected register.
  * @retval LCD Register Value.
  */
